doom/org-mode.org

#+TITLE: Org Mode Configuration
#+STARTUP: overview hideblocks
#+PROPERTY: header-args:emacs-lisp :tangle ~/.config/doom/extra/org-mode.el :results silent

* Inbox
** T Switch org conf wiki links to id based
** T sometimes org capture is colorless
** T finding an org theme
would like headings to be more whiteish.
todos / dones still have their colors, and the leading symbols can have color.
** T check out structure templates
[[https://orgmode.org/manual/Structure-Templates.html][Structure Templates (The Org Manual)]]
** T refile r stay here refile R follow to refiled point
** T add ~after org~ to evil keymap in org conf
** T org indenting weird
See when you have a level 5 heading, and then write text under it. It's /waaaaay/ in there
** T merging calendar and gtd
TODO only for things i want showing up in the agenda.

*** add "inactive"/"active mutually excl. tags to projects
this way only projects i'm currently working on will appear in the agenda
* Config
:PROPERTIES:
:ID:       ba52170c-cb7b-4884-8722-6bcfd040451e
:END:
The basic set of configuration variables determining Org's behaviour.
#+begin_src emacs-lisp
(after! org
  (setq org-directory "~/documents/org"
        ;; todo vars
        org-todo-keywords '((sequence "T(t)" "N(n)" "|" "W(w)" "D(d)" ))
        org-use-fast-todo-selection 'expert
        ;; startup vars
        org-startup-folded t
        org-startup-indented t
        org-hide-block-startup t
        ;; org-startup-with-inline-images t
        ;; fontifying
        org-fontify-done-headline t
        org-fontify-whole-heading-line t
        org-fontify-quote-and-verse-blocks t
        org-src-fontify-natively t
        ;; other
        org-cycle-include-plain-lists 'integrate ; plain lists start folded
        org-tags-column -60
        org-ellipsis "  " ;; folding symbol
        org-agenda-block-separator ""
        org-list-allow-alphabetical t   ; have a. A. a) A) list bullets
        ;;org-fold-catch-invisible-edits 'smart ; don't brazenly edit things you can't see
))
#+end_src

Remove auto fill mode, which introduces line breaks if lines get really long. I like to write long  paragraphs in org mode so this is just a nuisance for me.
#+begin_src emacs-lisp
(remove-hook 'org-mode-hook #'auto-fill-mode)
#+end_src

** Custom functions
*** Config tangling
Create a function to tangle config files after I save, so they're automatically kept up to date. However, only do this in my dots directory.
#+begin_src emacs-lisp
(defun tangle-dots ()
  (when (or (equal (file-name-directory (directory-file-name buffer-file-name))
               (concat (getenv "HOME") "/dots/"))
            (equal (file-name-directory (directory-file-name buffer-file-name))
               (concat (getenv "HOME") "/dots/doom/")))
    (org-babel-tangle)
    (message "%s tangled" buffer-file-name)))
(defun set-tangle-dots ()
  (add-hook! 'after-save-hook :append :local #'tangle-dots))
(add-hook 'org-mode-hook #'set-tangle-dots)
#+end_src

*** Parametrized Org Blocks
This implements variable replacement in org blocks.
#+BEGIN_SRC emacs-lisp :results none
(defun org-babel-execute:org (body params)
  "Return BODY with variables from PARAMS replaced by their values."
  (let* ((vars (cl-loop for par in params
            if (eq (car par) :var)
            collect (cons (symbol-name (cadr par)) (cddr par))))
     (re (regexp-opt (mapcar #'car vars) 'words))
     (pos 0))
    (while (string-match re body pos)
      (setq body (replace-match
          (format "%s" (cdr (assoc-string (match-string 0 body) vars)))
          nil nil
          body)))
    body))
#+END_SRC
*** C-Bsp for Pairs
This allows C-Backspace to be used for removing a pair of symbols, by using it on the left one; for now it's parens, sqbrackets, crbrackets, and quotes.
#+begin_src emacs-lisp
(defadvice backward-kill-word (around delete-pair activate)
  (if (or
       (eq (char-syntax (char-before)) ?\()
       (eq (char-syntax (char-before)) ?\[)
       (eq (char-syntax (char-before)) ?\")
       (eq (char-syntax (char-before)) ?\{))
      (progn
        (backward-char 1)
        (message "hi")
        (save-excursion
          (forward-sexp 1)
          (delete-char -1))
        (forward-char 1)
        (append-next-kill)
        (kill-backward-chars 1))
    ad-do-it))
#+end_src
*** Fold Prior Heading
When inserting a new heading, fold the previous one.
#+begin_src emacs-lisp :tangle no
(defun org-item-below--fold-prior (&rest args)
     (save-excursion
       (org-backward-element)
       (+org/close-fold))
  )
(advice-add '+org/insert-item-below :after 'org-item-below--fold-prior)
#+end_src

* Appearance
Would like my org mode to look nice and facilitate clear thinking. Would like to try the design in Figma first approach to try and clear out the cobwebs.

Need to check out faces in general. see =verbatim= and ~code~ faces and change the overall face. maybe diff face for inside code blocks (prob same as ~code~).

- [[https://orgmode.org/worg/org-tutorials/org-appearance.html][org appearance options]]
- [[https://zzamboni.org/post/beautifying-org-mode-in-emacs/][beautifying org mode]]

** Hooks
#+begin_src emacs-lisp
(add-hook! org-mode :append
           #'visual-line-mode
           #'org-appear-mode
           #'olivetti-mode
           #'org-superstar-mode
           #'org-toggle-pretty-entities
           #'variable-pitch-mode
           #'org-modern-mode
)
#+end_src

** Face/font settings
Making nicer and bigger faces for headings
Source Sans Pro version:
#+begin_src emacs-lisp
(custom-set-faces!
 '(org-document-title :family "Source Sans Pro" :height 2.5 :weight semibold)
 '(outline-1          :family "Source Sans Pro" :height 1.5 :weight semibold)
 '(outline-2          :family "Source Sans Pro" :height 1.3 :weight semibold)
 '(outline-3          :family "Source Sans Pro" :height 1.2 :weight semibold)
 '(outline-4          :family "Source Sans Pro" :height 1.1 :weight semibold)
 '(outline-5          :family "Source Sans Pro")
 '(outline-6          :family "Source Sans Pro")
 '(variable-pitch     :family "Source Sans Pro" :height 1.3  :weight regular)
 '(org-hide           :family "FiraCode Nerd Font" :height 0.8)
 )
#+end_src

ET Bembo:
#+begin_src emacs-lisp :tangle no
(custom-set-faces!
 '(outline-8          :family "ETBembo")
 '(outline-7          :family "ETBembo")
 '(outline-6          :family "ETBembo")
 '(outline-5          :family "ETBembo")
 '(outline-4          :family "ETBembo" :height 1.1)
 '(outline-3          :family "ETBembo" :height 1.3)
 '(outline-2          :family "ETBembo" :height 1.4)
 '(outline-1          :family "ETBembo" :height 1.5)
 '(org-document-title :family "ETBembo" :height 2.5 :underline nil)
 '(variable-pitch     :family "ETBembo" :height 1.4  :weight book)
 ;'(variable-pitch     :family "ETBembo" :height 150 :weight book)
 ;'(org-default        :family "ETBembo" :height 200 :weight book)
 '(org-hide           :family "FiraCode Nerd Font" :height 0.8)

 '(org-document-title :family "ETBembo" :weight bold :height 2.2 :underline nil)
 '(org-document-info-keyword :foreground "#676E95", :extend nil
                      :family "FiraCode Nerd Font" :height 200 :weight regular)
 '(org-meta-line      :foreground "#676E95", :extend nil
                      :family "FiraCode Nerd Font" :height 100 :weight regular)
 '(org-superstar-header-bullet :family "FiraCode Nerd Font")
 '(org-checkbox-statistics-todo :height 0.8)
 '(org-checkbox-statistics-done :height 0.8)
 ;'(org-latex-and-related :family "FiraCode Nerd Font" :weight normal :foreground "#82aaff")
 ;'(org-date :family "FiraCode Nerd Font" :weight normal :foreground "#82aaff")
 ;'(org-table :family "FiraCode Nerd Font")
 ;'(org-special-keyword :family "FiraCode Nerd Font" :weight normal :height 0.75 )
 '(fixed-pitch        :family "FiraCode Nerd Font"   :height 100))
#+end_src

Faces I want in fixed pitch:
#+begin_src emacs-lisp
(custom-set-faces!
 '(org-document-info-keyword :foreground "#676E95", :extend nil
                      :family "FiraCode Nerd Font" :weight regular)
 '(org-meta-line      :foreground "#676E95", :extend nil :height 0.8
                      :family "FiraCode Nerd Font" :weight regular)
 '(org-superstar-header-bullet :family "FiraCode Nerd Font")
 '(org-checkbox-statistics-todo :height 0.8)
 '(org-checkbox-statistics-done :height 0.8)
 '(org-tag   :family "FiraCode Nerd Font" :height 0.6)
 '(org-date  :family "FiraCode Nerd Font" :foreground nil)
 '(org-table :family "FiraCode Nerd Font" :height 0.8)
 ;'(org-table :family "FiraCode Nerd Font" :height 0.8 :inherit fixed-pitch)
 '(hl-line   :background nil)
 '(fixed-pitch        :family "FiraCode Nerd Font"   :height 0.8)
;'(org-special-keyword :family "FiraCode Nerd Font" :weight normal :height 0.75 )
;'(org-latex-and-related :family "FiraCode Nerd Font" :weight normal :foreground "#82aaff")
 '(org-block             :family "FiraCode Nerd Font" :height 0.8)
 '(org-block-begin-line  :family "FiraCode Nerd Font")
 '(org-block-end-line    :family "FiraCode Nerd Font"))
#+end_src

Haven't figured out how to reference theme colors in the ~custom-set-faces!~ macro, so I made a function to set it in a hook.
#+begin_src emacs-lisp
(defun block-bg-change ()
   (set-face-attribute 'org-block-begin-line nil :background (doom-color 'bg))
   (set-face-attribute 'org-block-end-line   nil :background (doom-color 'bg))
)

(add-hook 'org-mode-hook 'block-bg-change)
#+end_src

My old monospaced version setup:
#+begin_src emacs-lisp :tangle no
(custom-set-faces!
 '(org-document-info-keyword :foreground "#676E95", :extend nil
                      :family "FiraCode Nerd Font" :weight regular)
 '(org-meta-line      :foreground "#676E95", :extend nil
                      :family "FiraCode Nerd Font" :weight regular)
 '(org-superstar-leading-bullet :family "FiraCode Nerd Font")
 '(org-latex-and-related :weight normal :foreground "#82aaff")
 '(org-date :weight normal :foreground "#82aaff")
 '(org-special-keyword :weight normal :height 0.75 ))
#+end_src

** Margins
Turn off line numbers, sets some margin on left and right sides of the buffer, and turns off tildes on empty lines.
#+begin_src emacs-lisp
(add-hook 'org-mode-hook (lambda ()
  (display-line-numbers-mode -1)
  (setq left-margin-width 2)
  (setq right-margin-width 2)
  (vi-tilde-fringe-mode -1)))
#+end_src
olivetti mode: if there is only one buffer, centers it with plenty of room on the sides.
#+begin_src emacs-lisp
(use-package! olivetti
  :after org olivetti
  :config
    ;(setq olivetti-min-body-width 110
    (setq olivetti-body-width 100
          olivetti-style 'fancy ; fantastic new layout
          olivetti-margin-width 6))

(custom-set-faces! '(fringe :background "#272B3A"))
;(custom-set-faces! '(fringe :background (doom-color 'blue)))
#+end_src

