doom-mobile/extra/org-mode.el
(after! org
  (setq org-directory "~/org"
        ;; todo vars
        org-todo-keywords '((sequence "T(t)" "N(n)" "|" "W(w)" "D(d)" ))
        org-use-fast-todo-selection 'expert
        ;; startup vars
        org-startup-folded t
        org-startup-indented t
        org-hide-block-startup t
        ;; org-startup-with-inline-images t
        ;; fontifying
        org-fontify-done-headline t
        org-fontify-whole-heading-line t
        org-fontify-quote-and-verse-blocks t
        org-src-fontify-natively t
        ;; other
        org-cycle-include-plain-lists 'integrate ; plain lists start folded
        org-tags-column -60
        org-ellipsis "  " ;; folding symbol
        org-agenda-block-separator ""
        org-list-allow-alphabetical t   ; have a. A. a) A) list bullets
        ;;org-fold-catch-invisible-edits 'smart ; don't brazenly edit things you can't see
))

(remove-hook 'org-mode-hook #'auto-fill-mode)

(defun tangle-dots ()
  (when (or (equal (file-name-directory (directory-file-name buffer-file-name))
               (concat (getenv "HOME") "/dots/"))
            (equal (file-name-directory (directory-file-name buffer-file-name))
               (concat (getenv "HOME") "/dots/doom/")))
    (org-babel-tangle)
    (message "%s tangled" buffer-file-name)))
(defun set-tangle-dots ()
  (add-hook! 'after-save-hook :append :local #'tangle-dots))
(add-hook 'org-mode-hook #'set-tangle-dots)

(defun org-babel-execute:org (body params)
  "Return BODY with variables from PARAMS replaced by their values."
  (let* ((vars (cl-loop for par in params
            if (eq (car par) :var)
            collect (cons (symbol-name (cadr par)) (cddr par))))
     (re (regexp-opt (mapcar #'car vars) 'words))
     (pos 0))
    (while (string-match re body pos)
      (setq body (replace-match
          (format "%s" (cdr (assoc-string (match-string 0 body) vars)))
          nil nil
          body)))
    body))

(defadvice backward-kill-word (around delete-pair activate)
  (if (or
       (eq (char-syntax (char-before)) ?\()
       (eq (char-syntax (char-before)) ?\[)
       (eq (char-syntax (char-before)) ?\")
       (eq (char-syntax (char-before)) ?\{))
      (progn
        (backward-char 1)
        (message "hi")
        (save-excursion
          (forward-sexp 1)
          (delete-char -1))
        (forward-char 1)
        (append-next-kill)
        (kill-backward-chars 1))
    ad-do-it))

(add-hook! org-mode :append
           #'visual-line-mode
           #'org-appear-mode
           #'olivetti-mode
           #'org-superstar-mode
           #'org-toggle-pretty-entities
           #'variable-pitch-mode
           #'org-modern-mode
)

(custom-set-faces!
 '(org-document-title :family "Source Sans Pro" :height 2.5 :weight semibold)
 '(outline-1          :family "Source Sans Pro" :height 1.5 :weight semibold)
 '(outline-2          :family "Source Sans Pro" :height 1.3 :weight semibold)
 '(outline-3          :family "Source Sans Pro" :height 1.2 :weight semibold)
 '(outline-4          :family "Source Sans Pro" :height 1.1 :weight semibold)
 '(outline-5          :family "Source Sans Pro")
 '(outline-6          :family "Source Sans Pro")
 '(variable-pitch     :family "Source Sans Pro" :height 1.3  :weight regular)
 '(org-hide           :family "FiraCode Nerd Font" :height 0.8)
 )

(custom-set-faces!
 '(org-document-info-keyword :foreground "#676E95", :extend nil
                      :family "FiraCode Nerd Font" :weight regular)
 '(org-meta-line      :foreground "#676E95", :extend nil :height 0.8
                      :family "FiraCode Nerd Font" :weight regular)
 '(org-superstar-header-bullet :family "FiraCode Nerd Font")
 '(org-checkbox-statistics-todo :height 0.8)
 '(org-checkbox-statistics-done :height 0.8)
 '(org-tag   :family "FiraCode Nerd Font" :height 0.6)
 '(org-date  :family "FiraCode Nerd Font" :foreground nil)
 '(org-table :family "FiraCode Nerd Font" :height 0.8)
 ;'(org-table :family "FiraCode Nerd Font" :height 0.8 :inherit fixed-pitch)
 '(hl-line   :background nil)
 '(fixed-pitch        :family "FiraCode Nerd Font"   :height 0.8)
;'(org-special-keyword :family "FiraCode Nerd Font" :weight normal :height 0.75 )
;'(org-latex-and-related :family "FiraCode Nerd Font" :weight normal :foreground "#82aaff")
 '(org-block             :family "FiraCode Nerd Font" :height 0.8)
 '(org-block-begin-line  :family "FiraCode Nerd Font")
 '(org-block-end-line    :family "FiraCode Nerd Font"))

(defun block-bg-change ()
   (set-face-attribute 'org-block-begin-line nil :background (doom-color 'bg))
   (set-face-attribute 'org-block-end-line   nil :background (doom-color 'bg))
)

(add-hook 'org-mode-hook 'block-bg-change)

(add-hook 'org-mode-hook (lambda ()
  (display-line-numbers-mode -1)
  (setq left-margin-width 2)
  (setq right-margin-width 2)
  (vi-tilde-fringe-mode -1)))

(use-package! olivetti
  :after org olivetti
  :config
    ;(setq olivetti-min-body-width 110
    (setq olivetti-body-width 100
          olivetti-style 'fancy ; fantastic new layout
          olivetti-margin-width 6))

(custom-set-faces! '(fringe :background "#272B3A"))
;(custom-set-faces! '(fringe :background (doom-color 'blue)))
