doom/org-mode.org
** Symbol replacements
- look into exponents as entities to see if i can make it so brackets aren't required or at least are easier to enter
- add the symbol ^{-1} for \inv and \mapsto if it exists
- emphasis like /this/ but also on symbols/entities?
- swap out the \to \Rightarrow for longer or bigger versions? maybe look at entities in larger faces
- [[https://www.reddit.com/r/emacs/comments/o04it0/share_your_prettifysymbolsalist/][similar to entities but no backslash. for bullets, ellipsis, etc]]

~org-entities~: See the variable ~org-entities-user~ to add new symbol replacements for pretty entities in org.
If the symbols rendering require packages to be loaded, add these packages to ~org-latex-packages-alist~.
#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t
      org-entities-user
    '(("R"            "\\mathbb{R}" t   "&#82;" "R" "R" "ℝ")
      ("C"            "\\mathbb{C}" t   "&#67;" "C" "C" "ℂ")
      ("N"            "\\mathbb{N}" t   "&#78;" "N" "N" "ℕ")
      ("Z"            "\\mathbb{Z}" t   "&#90;" "Z" "Z" "ℤ")
      ("mapsto"       "\\mapsto"    t   "&#8614;" "mapsto" "mapsto" "↦")
      ("contra"       "\\lightning"  nil "&#11085;" "contra" "contra" "↯")
      ("Rarrow"       "\\Rightarrow"  t "&#8658;" "=>" "=>" "⇒")
      ("inj"          "\\hookrightarrow" t "&#8618;" "inj" "inj" "↪")
      ;("yo"           "\\yo"           nil "&#x3088;" "y" "y" "よ")
      ("f"            "\\textit{f}" nil "&fnof;" "f" "f" "ƒ")))

#+end_src

~org-appear~: when point is over an entity, show the contents.
#+begin_src emacs-lisp
  (setq org-appear-autoemphasis t   ; need org-hide-emphasis-markers
        org-appear-autosubmarkers t ; need org-pretty-entities
        org-appear-autoentities t   ; need org-pretty-entities
  )
#+end_src

** T Headings
Strike through completed org entries
#+begin_src emacs-lisp
(custom-set-faces!
  '(org-todo          :family "FiraCode Nerd Font")
  '(org-done          :family "FiraCode Nerd Font" :strike-through t)
  '(org-headline-done :strike-through t))
#+end_src

Not a fan of ~org-modern~'s todo tags. I do my own replacement and make the faces nicer.
~prettify-symbols~
#+begin_src emacs-lisp
(setq org-modern-todo nil)
(add-hook! org-mode :append
   (setq prettify-symbols-alist
        '(
         ;("T" . "T") ("N" . "N") ("W" . "W") ("D" . "D")
         (":PROPERTIES:" . "")    ("#+PROPERTY:" . "")
         ;("[#A]" . "") ("[#B]" . "") ("[#C]" . "")
         ;("#+begin_src" . "»")    ("#+end_src" . "«")
         ;("#+BEGIN_SRC" . "»")    ("#+END_SRC" . "«")
         ;("#+BEGIN_EXPORT" . "»") ("#+END_EXPORT" . "«")
         ;("#+RESULTS:" . "")    ("#+STARTUP:" . "»")
         ;("#+STARTUP:" . "")     (":Effort:" . "")
         ;("[0/1]" . "󰽤") ("[1/1]" . "󰪥")
         ;("[1/2]" . "󰪡") ("[0/2]" . "󰽤") ("[2/2]" . "󰪥")
         ;("[0/3]" . "") ("[1/3]" . "󰫄") ("[2/3]" . "󰫆") ("[3/3]" . "󰫈")
         ;("[0/4]" . "󰽤") ("[1/4]" . "󰪟")
         ;("[2/4]" . "󰪡") ("[3/4]" . "󰪣") ("[4/4]" . "󰪥")
         ;("[0/6]" . "") ("[1/6]" . "󰫃") ("[2/6]" . "󰫄")
         ;("[3/6]" . "󰫅") ("[4/6]" . "󰫆") ("[5/6]" . "󰫇") ("[6/6]" . "󰫈")
         ;("[0/8]" . "󰽤") ("[1/8]" . "󰪞") ("[2/8]" . "󰪟") ("[3/8]" . "󰪠")
         ;("[4/8]" . "󰪡") ("[5/8]" . "󰪢") ("[6/8]" . "󰪣") ("[7/8]" . "󰪤")
         ;("[8/8]" . "󰪥")
         ;("SCHEDULED:" . "")      ("DEADLINE:" . "")
         ))
   (prettify-symbols-mode 1)
   )
#+end_src

Hiding keywords
#+begin_src emacs-lisp
(setq org-hidden-keywords '(title)) ;; hide #+TITLE:
#+end_src
** Outline Stars
Although I use org-modern for lots of other things, I don't use it for dealing with stars in outlines, for two reasons:
- my preferred star symbols don't work with it
- it doesn't have an ~org-superstar-remove-leading-stars~ equivalent, to make it so that not only are leading stars hidden, they're actually removed entirely.
I'd guess both of these problems are eminently fixable, but since I have something that works with ~org-superstar~, I'm sticking with it for now.
#+begin_src emacs-lisp
(setq org-modern-star nil) ; alternatives:  '("◉" "◈" "○" "▷")
(setq org-superstar-headline-bullets-list '("󱂈" "󱂉" "󱂊" "󱂋" "󱂌" "󱂍")
      org-superstar-remove-leading-stars t)
#+end_src
** Plain Lists
For plain lists and check lists, on the other hand, ~org-modern~ works just fine.
#+begin_src emacs-lisp
(setq org-modern-list '((43 . "◦")
                        (45 . "•")
                        (42 . "–"))
  org-modern-checkbox '((88 . "☑")
                        (45 . "◩")
                        (32 . "□")))
#+end_src
I don't love the look for progress statistics, so I turn that off.
#+begin_src emacs-lisp
(setq org-modern-progress nil)
#+end_src

** T Make org ids and uids look nice
** T Tags
Switch off ~org-modern~ tags.
#+begin_src emacs-lisp
(setq org-modern-tag nil)
#+end_src

* Capture, Refile, Archive
** T Capture
Types of captures I do often?
- small emacs config todo
- small arch config todo
- general todo
- reading list

My options are to either make these all their own capture templates, or put all of it in the inbox and do refiling later.

Having too many capture templates lands me back at the whole indecision problem capture is meant to *solve*.

- [ ] make ~org-capture-finalize~ easier to access
  either by rebinding ~SPC f s~ to it in capture mode, hooking saving with it, or something else. Beware though because I habitually save pretty often.
- [ ] change capture buffer display
  change info a top, and make it appear at bottom of screen instead of to side

Here we define my capture templates. It's mainly one inbox-based one, and one for my reading list.
#+begin_src emacs-lisp
(after! org
   (setq org-capture-templates '(
      ("t" "T" entry (file "gtd/inbox.org") "* T %?" :unnarrowed t)
      ( "r" "Reading list" )
      ("re" "Emacs" entry (file/headline "gtd/rlist.org" "Emacs") "* %?")
      ("ro" "Org Mode" entry (file+olp "gtd/rlist.org" "Org Mode" "Other") "* %?")
      ("ra" "Arch" entry (file+headline "gtd/rlist.org" "Arch") "* %?")
      ("rr" "Other" entry (file "gtd/rlist.org" ) "* %?")
   )))
#+end_src

** T Refile
One of my first elisp functions  I'm actually proud of!

There's still more that can bo done. See using the following functions to make this function even nicer:
- ~elt~
- ~dolist~
#+begin_src emacs-lisp
(defun make-refile-targets (dir)
  ;; takes as input a directory, and makes an alist of all org files in the
  ;; directory, associated with a specification of maximal level 2.
  (let* ((files (directory-files dir 'full (rx ".org" eos)))
         (maxlev (make-list (length files) '(:maxlevel . 2))))
    (cl-pairlis files maxlev)))


(after! org
    (setq org-refile-targets (append
                               (make-refile-targets "~/dots/doom")
                               (make-refile-targets "~/documents/org/gtd")))
  )
#+end_src

** Archive
I use archiving in a pretty simple fashion, just sending headings into one centralized archive directory.
#+begin_src emacs-lisp
(setq org-archive-location "~/documents/.org-archive/%s_archive::")
#+end_src

* Agenda
#+begin_src emacs-lisp
(after! org
  (setq org-agenda-skip-scheduled-if-done t
        org-agenda-files (list
                          (concat org-directory "/gtd/")
                          (concat org-directory "/calendar/"))
        org-agenda-window-setup 'other-tab
        ;org-agenda-block-separator ""
        ;; styling
        org-agenda-tags-column 'auto
        org-agenda-block-separator ?─
        org-agenda-time-grid
        '((daily today require-timed)
          (800 1000 1200 1400 1600 1800 2000)
          " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
        org-agenda-current-time-string
          "⭠ now ─────────────────────────────────────────────────"
))
#+end_src

Editing the Agenda keymap
#+begin_src emacs-lisp
(map! :map evil-org-agenda-mode-map
      :m "q" 'org-agenda-quit
      :m "Q" 'org-agenda-exit
      )
#+end_src

** T Agenda ordering

I'd like to have a custom ordering for the todo items in my agenda view. This doesn't need to be hard coded but maybe learning how tf it works would fix this problem.
** T Appearance
Making nicer and bigger faces for headings
Source Sans Pro version:
#+begin_src emacs-lisp :tangle no
;; First create new face which is a copy of hl-line-face
(copy-face 'hl-line 'hl-line-agenda-face)
(copy-face 'default 'default-agenda-face)

;; Change what you want in this new face
(set-face-attribute 'hl-line-agenda-face nil
                    :family "Source Sans Pro")

(set-face-attribute 'default-agenda-face nil
                    :family "Source Sans Pro")

;; The function to use the new face
(defun my-org-agenda-hl-line ()
  (set (make-local-variable 'hl-line-face) 'hl-line-agenda-face)
  (buffer-face-set 'default-agenda-face)
  (hl-line-mode)
)

;; Finally, the hook
(add-hook 'org-agenda-mode-hook 'my-org-agenda-hl-line)

(custom-set-faces!
 '(org-agenda-structure :family "Source Sans Pro" :height 2.5 :weight semibold)
 ;'(variable-pitch     :family "Source Sans Pro" :height 1.4  :weight regular)
 ;'(org-hide           :family "FiraCode Nerd Font" :height 0.8)
 )
#+end_src
#+begin_src emacs-lisp
(custom-set-faces!
 '(org-agenda-structure :family "Source Sans Pro" :height 2.5 :weight semibold)
 )
#+end_src

Faces I want in fixed pitch:
#+begin_src emacs-lisp :tangle no
(custom-set-faces!
 '(org-document-info-keyword :foreground "#676E95", :extend nil
                      :family "FiraCode Nerd Font" :weight regular)
 '(org-meta-line      :foreground "#676E95", :extend nil :height 0.8
                      :family "FiraCode Nerd Font" :weight regular)
 '(org-superstar-header-bullet :family "FiraCode Nerd Font")
 '(org-checkbox-statistics-todo :height 0.8)
 '(org-checkbox-statistics-done :height 0.8)
 '(org-tag   :family "FiraCode Nerd Font" :height 0.6)
 '(org-date  :family "FiraCode Nerd Font" :foreground "#82aaff")
 '(org-table :family "FiraCode Nerd Font" :height 0.8)
 '(fixed-pitch        :family "FiraCode Nerd Font"   :height 0.8)
 ;'(org-special-keyword :family "FiraCode Nerd Font" :weight normal :height 0.75 )
 ;'(org-latex-and-related :family "FiraCode Nerd Font" :weight normal :foreground "#82aaff")
 )
#+end_src

Hooks for olivetti:
#+begin_src emacs-lisp
(add-hook! org-agenda-mode
           #'olivetti-mode
          )
#+end_src

