doom-mobile/extra/org-mode.el

(setq org-hide-emphasis-markers t
      org-entities-user
    '(("R"            "\\mathbb{R}" t   "&#82;" "R" "R" "ℝ")
      ("C"            "\\mathbb{C}" t   "&#67;" "C" "C" "ℂ")
      ("N"            "\\mathbb{N}" t   "&#78;" "N" "N" "ℕ")
      ("Z"            "\\mathbb{Z}" t   "&#90;" "Z" "Z" "ℤ")
      ("mapsto"       "\\mapsto"    t   "&#8614;" "mapsto" "mapsto" "↦")
      ("contra"       "\\lightning"  nil "&#11085;" "contra" "contra" "↯")
      ("Rarrow"       "\\Rightarrow"  t "&#8658;" "=>" "=>" "⇒")
      ("inj"          "\\hookrightarrow" t "&#8618;" "inj" "inj" "↪")
      ;("yo"           "\\yo"           nil "&#x3088;" "y" "y" "よ")
      ("f"            "\\textit{f}" nil "&fnof;" "f" "f" "ƒ")))

  (setq org-appear-autoemphasis t   ; need org-hide-emphasis-markers
        org-appear-autosubmarkers t ; need org-pretty-entities
        org-appear-autoentities t   ; need org-pretty-entities
  )

(custom-set-faces!
  '(org-todo          :family "FiraCode Nerd Font")
  '(org-done          :family "FiraCode Nerd Font" :strike-through t)
  '(org-headline-done :strike-through t))

(setq org-modern-todo nil)
(add-hook! org-mode :append
   (setq prettify-symbols-alist
        '(
         ;("T" . "T") ("N" . "N") ("W" . "W") ("D" . "D")
         (":PROPERTIES:" . "")    ("#+PROPERTY:" . "")
         ;("[#A]" . "") ("[#B]" . "") ("[#C]" . "")
         ;("#+begin_src" . "»")    ("#+end_src" . "«")
         ;("#+BEGIN_SRC" . "»")    ("#+END_SRC" . "«")
         ;("#+BEGIN_EXPORT" . "»") ("#+END_EXPORT" . "«")
         ;("#+RESULTS:" . "")    ("#+STARTUP:" . "»")
         ;("#+STARTUP:" . "")     (":Effort:" . "")
         ;("[0/1]" . "󰽤") ("[1/1]" . "󰪥")
         ;("[1/2]" . "󰪡") ("[0/2]" . "󰽤") ("[2/2]" . "󰪥")
         ;("[0/3]" . "") ("[1/3]" . "󰫄") ("[2/3]" . "󰫆") ("[3/3]" . "󰫈")
         ;("[0/4]" . "󰽤") ("[1/4]" . "󰪟")
         ;("[2/4]" . "󰪡") ("[3/4]" . "󰪣") ("[4/4]" . "󰪥")
         ;("[0/6]" . "") ("[1/6]" . "󰫃") ("[2/6]" . "󰫄")
         ;("[3/6]" . "󰫅") ("[4/6]" . "󰫆") ("[5/6]" . "󰫇") ("[6/6]" . "󰫈")
         ;("[0/8]" . "󰽤") ("[1/8]" . "󰪞") ("[2/8]" . "󰪟") ("[3/8]" . "󰪠")
         ;("[4/8]" . "󰪡") ("[5/8]" . "󰪢") ("[6/8]" . "󰪣") ("[7/8]" . "󰪤")
         ;("[8/8]" . "󰪥")
         ;("SCHEDULED:" . "")      ("DEADLINE:" . "")
         ))
   (prettify-symbols-mode 1)
   )

(setq org-hidden-keywords '(title)) ;; hide #+TITLE:

(setq org-modern-star nil) ; alternatives:  '("◉" "◈" "○" "▷")
(setq org-superstar-headline-bullets-list '("󱂈" "󱂉" "󱂊" "󱂋" "󱂌" "󱂍")
      org-superstar-remove-leading-stars t)

(setq org-modern-list '((43 . "◦")
                        (45 . "•")
                        (42 . "–"))
  org-modern-checkbox '((88 . "☑")
                        (45 . "◩")
                        (32 . "□")))

(setq org-modern-progress nil)

(setq org-modern-tag nil)

(after! org
   (setq org-capture-templates '(
      ("t" "T" entry (file "gtd/inbox.org") "* T %?" :unnarrowed t)
      ( "r" "Reading list" )
      ("re" "Emacs" entry (file/headline "gtd/rlist.org" "Emacs") "* %?")
      ("ro" "Org Mode" entry (file+olp "gtd/rlist.org" "Org Mode" "Other") "* %?")
      ("ra" "Arch" entry (file+headline "gtd/rlist.org" "Arch") "* %?")
      ("rr" "Other" entry (file "gtd/rlist.org" ) "* %?")
   )))

(defun make-refile-targets (dir)
  ;; takes as input a directory, and makes an alist of all org files in the
  ;; directory, associated with a specification of maximal level 2.
  (let* ((files (directory-files dir 'full (rx ".org" eos)))
         (maxlev (make-list (length files) '(:maxlevel . 2))))
    (cl-pairlis files maxlev)))


(after! org
    (setq org-refile-targets (append
                               (make-refile-targets "~/dots/doom")
                               (make-refile-targets "~/org/gtd")))
  )

(setq org-archive-location "~/.org-archive/%s_archive::")

(after! org
  (setq org-agenda-skip-scheduled-if-done t
        org-agenda-files (list
                          (concat org-directory "/gtd/")
                          (concat org-directory "/calendar/"))
        org-agenda-window-setup 'other-tab
        ;org-agenda-block-separator ""
        ;; styling
        org-agenda-tags-column 'auto
        org-agenda-block-separator ?─
        org-agenda-time-grid
        '((daily today require-timed)
          (800 1000 1200 1400 1600 1800 2000)
          " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
        org-agenda-current-time-string
          "⭠ now ─────────────────────────────────────────────────"
))

(map! :map evil-org-agenda-mode-map
      :m "q" 'org-agenda-quit
      :m "Q" 'org-agenda-exit
      )

(custom-set-faces!
 '(org-agenda-structure :family "Source Sans Pro" :height 2.5 :weight semibold)
 )

(add-hook! org-agenda-mode
           #'olivetti-mode
          )
