doom/org-mode.org
** Custom Commands
#+begin_src emacs-lisp :tangle no
      (org-agenda-sorting-strategy '((tags todo-state-down priority-down category-keep)))
 (tags-todo "tickler-SCHEDULED={.+}/T|LOOP|W|N"
      ((org-agenda-overriding-header "Unscheduled Reminders\n")))
(todo "PROJ" ((org-agenda-overriding-header "Projects\n")))
(tags "CLOSED>=\"<-7d>\"|LAST_REPEAT>=\"<-7d>\""
     ((org-agenda-overriding-header "Completed in the Last 7 Days\n")))
(agenda "" ((org-agenda-span 'day)
(org-agenda-sorting-strategy '((agenda time-up priority-down category-keep)))
(org-agenda-show-log t)
(org-agenda-log-mode-items '(clock))))
#+end_src
#+begin_src emacs-lisp
(setq org-agenda-custom-commands
  '(("z" "My Agenda"
     ((todo "N"
            ((org-agenda-overriding-header "Next Tasks\n")))
      (tags-todo "-tickler/T|W"
           ((org-agenda-overriding-header "Task Stack\n")))
      (agenda ""
           ((org-agenda-span 7)
            (org-agenda-start-day "+1d")
            (org-agenda-overriding-header "Upcoming\n")
            (org-agenda-show-log nil)))))
    ("n" "My Next Tasks"
     ((todo "N"
        ((org-agenda-overriding-header "\nTasks\n"))
     ))
   ))
)
#+end_src
** T [[https://www.reddit.com/r/orgmode/comments/i3upt6/prettifysymbolsmode_not_working_with_orgagenda/][Prettify symbols in Agenda]]
** T Agenda keymap
** T Org Agenda open in current window
here: [[https://emacs.stackexchange.com/questions/26655/org-mode-agenda-open-in-left-window-by-default][Org-Mode Agenda Open in Left Window by Default - Emacs Stack Exchange]]
but would like to do dispatcher in minibuffer/echo area as well.
* Calendar
I have started getting my org calendar and nextcloud calendar integrated. A few things stand in the way:

** T Rice up my calendar
[[https://github.com/ml729/calfw-blocks][calfw-blocks]]
#+begin_src emacs-lisp
(use-package calfw-blocks
  :hook (LaTeX-mode . aas-activate-for-major-mode)
  :hook (org-mode . aas-activate-for-major-mode)
  :config
  (aas-set-snippets 'text-mode
    ;; expand unconditionally
    ";o-" "ō"
    ";i-" "ī"
    ";a-" "ā"
    ";u-" "ū"
    ";e-" "ē")
  (aas-set-snippets 'latex-mode
    ;; set condition!
    :cond #'texmathp ; expand only while in math
    "supp" "\\supp"
    "On" "O(n)"
    "O1" "O(1)"
    ;; Use YAS/Tempel snippets with ease!
    ";ig" #'insert-register
    ";call-sin"
    (lambda (angle) ; Get as fancy as you like
      (interactive "sAngle: ")
      (insert (format "%s" (sin (string-to-number angle))))))
  ;; disable snippets by redefining them with a nil expansion
  (aas-set-snippets 'latex-mode
    "mk"   '(yas "\$$1\$$0") ; YASnippet snippet shorthand form
    "supp" nil))

(add-to-list 'load-path "~/.config/doom")
(require 'laas)
#+end_src


** T Prettify org properties and uid for cal management
** Date Formats
Custom date formats
#+begin_src emacs-lisp
;(setq-default org-display-custom-times t)
;(setq org-time-stamp-custom-formats '("<%a %b %e>" . "<%a %b %e %Y %H:%M>"))
(setq cfw:event-format-detail "%s - %e : %l")
(setq cfw:event-format-overview "%s - %e : %l")

#+end_src
** Holidays
#+begin_src emacs-lisp
(setq calendar-holidays '((holiday-fixed 1 1 "New Year's Day")
        (holiday-float 1 1 3 "Martin Luther King Day")
        (holiday-fixed 2 2 "Groundhog Day")
        (holiday-fixed 2 14 "Valentine's Day")
        (holiday-float 2 1 3 "President's Day")
        (holiday-fixed 3 17 "St. Patrick's Day")
        (holiday-fixed 4 1 "April Fools' Day")
        (holiday-float 5 0 2 "Mother's Day")
        (holiday-float 5 1 -1 "Memorial Day")
        (holiday-fixed 6 14 "Flag Day")
        (holiday-float 6 0 3 "Father's Day")
        (holiday-fixed 7 4 "Independence Day")
        (holiday-float 9 1 1 "Labor Day")
        (holiday-float 10 1 2 "Columbus Day")
        (holiday-fixed 10 31 "Halloween")
        (holiday-fixed 11 11 "Veteran's Day")
        (holiday-float 11 4 4 "Thanksgiving")
        (holiday-easter-etc)
        (holiday-fixed 12 25 "Christmas")
        (holiday-chinese-new-year)
        (if calendar-chinese-all-holidays-flag
            (append
             (holiday-chinese 1 15 "Lantern Festival")
             (holiday-chinese-qingming)
             (holiday-chinese 5 5 "Dragon Boat Festival")
             (holiday-chinese 7 7 "Double Seventh Festival")
             (holiday-chinese 8 15 "Mid-Autumn Festival")
             (holiday-chinese 9 9 "Double Ninth Festival")
             (holiday-chinese-winter-solstice)))
        (solar-equinoxes-solstices)
        (holiday-sexp calendar-daylight-savings-starts
                      (format "Daylight Saving Time Begins %s"
                              (solar-time-string
                               (/ calendar-daylight-savings-starts-time
                                  (float 60))
                               calendar-standard-time-zone-name)))
        (holiday-sexp calendar-daylight-savings-ends
                      (format "Daylight Saving Time Ends %s"
                              (solar-time-string
                               (/ calendar-daylight-savings-ends-time
                                  (float 60))
                               calendar-daylight-time-zone-name)))))
#+end_src
** Org-Caldav
Syncs org events with my caldav nextcloud calendar.
Login info ist encrypted and stored in ~~/.authinfo.gpg~
#+begin_src emacs-lisp
(setq org-caldav-url "https://cloud.thain.xyz/remote.php/dav/calendars/liam"
      org-icalendar-timezone "Europe/Amsterdam")

(setq org-caldav-calendars
  '((:calendar-id "personal"
     :files ("~/documents/org/calendar/personal.org")
     :inbox (file+headline "~/documents/org/calendar/personal.org" "Inbox"))
    (:calendar-id "soenda"
     :files ("~/documents/org/calendar/soenda.org")
     :inbox (file+headline "~/documents/org/calendar/soenda.org" "Inbox"))
    (:calendar-id "birthdays"
     :files ("~/documents/org/calendar/birthdays.org")
     :inbox (file "~/documents/org/calendar/birthdays.org"))
  )
)
#+end_src

From the example: what does this do?
~:skip-conditions (regexp "soccer")~
* Link Insertion
** Modifying link insertion
Create a function to modify the behaviour of link insertion, so if on a whitespace character, it inserts ahead of point instead of at point. It does this by just inserting a space before the link-insertion runs.
#+begin_src emacs-lisp
(defun org-insert-link--add-space-after (&rest args)
     (let ((is-in-evil-normal-mode
              (and (bound-and-true-p evil-mode)
                   (not (bound-and-true-p evil-insert-state-minor-mode))
                   (looking-at "[[:blank:]]"))))
       (if is-in-evil-normal-mode (insert " "))))
(advice-add 'org-insert-link :before 'org-insert-link--add-space-after)
(advice-add 'custom-org-cliplink :around 'org-insert-link--add-space-after)
#+end_src

** Org-cliplink
Cliplink is specifically for copying urls into org. This contacts the site and retrieves the name of the webpage. However, I also add in some specific extra cases for domains I retrieve links from often,
#+begin_src emacs-lisp
(defun custom-org-cliplink ()
  (interactive)
  (org-cliplink-insert-transformed-title
   (org-cliplink-clipboard-content)     ;take the URL from the CLIPBOARD
   (lambda (url title)
     (let* ((parsed-url (url-generic-parse-url url)) ;parse the url
            (clean-title
             (cond ;; if the host is github.com, cleanup the title
              ((string= (url-host parsed-url) "github.com")
               (replace-regexp-in-string ".*\/\\(.*\\)" "\\1" title))
              ;; otherwise keep the original title
              (t title))))
       ;; forward the title to the default org-cliplink transformer
       (org-cliplink-org-mode-link-transformer url clean-title)))))
#+end_src
*** T Options
Would like to learn about interactive functions, giving the option for cliplink to give /options/ when clipping a link. For example, here's a github page title:

** T Better Link Insertion
As of now I'm doing a weird ~org-insert-link~ which is a bit clunky as it requires ~C-Y~ for pasting the link. I like ~org-cliplink~ but it seeks out the title of the page. Might be nice for putting in rules like Github, but I would also like to find or make my own function that takes the link from the clipboard but prompts for the description.

- [ ] add a bind for going back after clicking a link: ~org-mark-ring-goto~
- [ ] org links dont pop up fundamental buffer that tells about tab completion
- [ ] also wanna use ~org-mark-ring-push~
- [ ] add bind for displaying link ~SPC m l t~ under point
- [ ] internal link naming for following the tree structure: e.g. Org/Keymap
- [X] add space before insertion

* Evil Keymap
#+begin_src emacs-lisp
(map! :map evil-org-mode-map :m :prefix "g"
      ;; left and right
      :m "h" 'evil-first-non-blank-of-visual-line
      :m "l" 'evil-end-of-visual-line
      ;; up and down
      :m "H" 'evil-org-top
      :m "K" 'org-up-element
      :m "k" 'org-backward-heading-same-level
      :m "J" 'org-down-element
      :m "j" 'org-forward-heading-same-level
      )
#+end_src
I want visual lines with ~j~ and ~k~, but buffer lines for ~A~, ~D~, etc. So instead of using ~evil-respect-visual-line-mode~, just rebind these two commands to their visual counterparts. Still need to somehow make this happen only in org mode ideally.
#+begin_src emacs-lisp
(map! :map evil-motion-state-map
      "j" 'evil-next-visual-line
      "k" 'evil-previous-visual-line
      )
#+end_src
* Export
** LaTeX
#+begin_src emacs-lisp :tangle no
(setq org-latex-default-packages-alist nil
      org-latex-toc-command nil
      org-latex-hyperref-template nil)
      org-format-latex-options (plist-put org-format-latex-options :scale 2.0)

(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))

(eval-after-load 'org
  '(setf org-highlight-latex-and-related '(latex)))

(setq org-latex-classes
   '(("my-article" "
\\documentclass[10pt,a4paper]{article}
\\include{~/.config/latex/prelude}

\\usepackage{hyperref}
\\hypersetup{
  colorlinks=true,
  linkcolor=[rgb]{0,0.37,0.53},
  citecolor=[rgb]{0,0.47,0.68},
  filecolor=[rgb]{0,0.37,0.53},
  urlcolor=[rgb]{0,0.37,0.53},
  pagebackref=true,
  linktoc=all,}"
      ("\\section{%s}" . "\\section*{%s}")
      ("\\subsection{%s}" . "\\subsection*{%s}")
      ("\\paragraph{%s}" . "\\paragraph*{%s}")
      ("\\subparagraph{%s}" . "\\subparagraph*{%s}")
)))
#+end_src
** HTML
** T Custom org backend
[[Https://www.reddit.com/r/emacs/comments/swvbmm/you_want_to_write_a_custom_org_backend_lets_write/][reddit post]]
* Inactive
